;Place localized text in this file

[GatlingMec X2CharacterTemplate]
strCharacterName="ADVENT Military Assault MEC"
strAcquiredText="ADVENT Military MECs possess thick armor plating and exotic weaponry"

[MEC_Shotgun X2WeaponTemplate]
FriendlyName="ADVENT MEC Shotgun"
FriendlyNamePlural="ADVENT MEC Shotguns"
BriefSummary="Powerful MEC sized shotguns deliver firepower like no other"
TacticalText="<Bullet/> Firing the primary weapon always ends the soldier's turn\n<Bullet/>"

[MEC_GatlingCannon X2WeaponTemplate]
FriendlyName="ADVENT Military Assault MEC Gatling Cannon"
FriendlyNamePlural="ADVENT Military Assault MEC Gatling Cannons"
BriefSummary="A giant minigun coupled with a massive ammo drum for extended deployments"
TacticalText="<Bullet/> Firing the primary weapon always ends the soldier's turn\n<Bullet/>"

[Phasic_Shot X2AbilityTemplate]
LocFriendlyName="Phase Shot"
LocLongDescription="The Military Assault MEC's shotgun is loaded with phase rounds, these rounds ignore armor, shields, and cover defense bonuses. Robotic entities cannot be targeted by this ability."
LocHelpText="Shotgun attacks ignore armor, shields, and cover defense bonuses. Robotic enemies cannot be targeted."
LocFlyOverText="Phase Shot"

[Gatling_Sweep X2AbilityTemplate]
LocFriendlyName="Gatling Sweep"
LocLongDescription="The Assault MEC targets a wide cone shaped area with minigun fire, low accuracy, does not shred armor."
LocHelpText="Targets a wide area in front of the MEC to assault with minigun fire, low accurracy, does not shred armor"
LocFlyOverText="Gatling Sweep"

[Gatling_Shot X2AbilityTemplate]
LocFriendlyName="Gatling Shot"
LocLongDescription="A powerful single target attack, this attack shreds 4 points of armor and causes bleeding. Very low accurracy at short range."
LocHelpText="Fire a devastating attack at a single target with your gatling cannon, shreds 4 points of armor, and causes bleeding. Very low accurracy at short range."
LocFlyOverText="Gatling Shot"